balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6011.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX2B1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX2B1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D0" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D00" edc:desc="" edc:mask="0x1" edc:name="TXB2D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D01" edc:desc="" edc:mask="0x1" edc:name="TXB2D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D02" edc:desc="" edc:mask="0x1" edc:name="TXB2D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D03" edc:desc="" edc:mask="0x1" edc:name="TXB2D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D04" edc:desc="" edc:mask="0x1" edc:name="TXB2D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D05" edc:desc="" edc:mask="0x1" edc:name="TXB2D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D06" edc:desc="" edc:mask="0x1" edc:name="TXB2D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D07" edc:desc="" edc:mask="0x1" edc:name="TXB2D07" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D10" edc:desc="" edc:mask="0x1" edc:name="TXB2D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D11" edc:desc="" edc:mask="0x1" edc:name="TXB2D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D12" edc:desc="" edc:mask="0x1" edc:name="TXB2D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D13" edc:desc="" edc:mask="0x1" edc:name="TXB2D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D14" edc:desc="" edc:mask="0x1" edc:name="TXB2D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D15" edc:desc="" edc:mask="0x1" edc:name="TXB2D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D16" edc:desc="" edc:mask="0x1" edc:name="TXB2D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D17" edc:desc="" edc:mask="0x1" edc:name="TXB2D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX2B2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX2B2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D2" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D3" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D20" edc:desc="" edc:mask="0x1" edc:name="TXB2D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D21" edc:desc="" edc:mask="0x1" edc:name="TXB2D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D22" edc:desc="" edc:mask="0x1" edc:name="TXB2D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D23" edc:desc="" edc:mask="0x1" edc:name="TXB2D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D24" edc:desc="" edc:mask="0x1" edc:name="TXB2D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D25" edc:desc="" edc:mask="0x1" edc:name="TXB2D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D26" edc:desc="" edc:mask="0x1" edc:name="TXB2D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D27" edc:desc="" edc:mask="0x1" edc:name="TXB2D27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D30" edc:desc="" edc:mask="0x1" edc:name="TXB2D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D31" edc:desc="" edc:mask="0x1" edc:name="TXB2D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D32" edc:desc="" edc:mask="0x1" edc:name="TXB2D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D33" edc:desc="" edc:mask="0x1" edc:name="TXB2D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D34" edc:desc="" edc:mask="0x1" edc:name="TXB2D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D35" edc:desc="" edc:mask="0x1" edc:name="TXB2D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D36" edc:desc="" edc:mask="0x1" edc:name="TXB2D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D37" edc:desc="" edc:mask="0x1" edc:name="TXB2D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX2B3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX2B3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D4" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D5" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TX2B2D40" edc:desc="" edc:mask="0x1" edc:name="TX2B2D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D41" edc:desc="" edc:mask="0x1" edc:name="TX2B2D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D42" edc:desc="" edc:mask="0x1" edc:name="TX2B2D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D43" edc:desc="" edc:mask="0x1" edc:name="TX2B2D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D44" edc:desc="" edc:mask="0x1" edc:name="TX2B2D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D45" edc:desc="" edc:mask="0x1" edc:name="TX2B2D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D46" edc:desc="" edc:mask="0x1" edc:name="TX2B2D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D47" edc:desc="" edc:mask="0x1" edc:name="TX2B2D47" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D50" edc:desc="" edc:mask="0x1" edc:name="TXB2D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D51" edc:desc="" edc:mask="0x1" edc:name="TXB2D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D52" edc:desc="" edc:mask="0x1" edc:name="TXB2D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D53" edc:desc="" edc:mask="0x1" edc:name="TXB2D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D54" edc:desc="" edc:mask="0x1" edc:name="TXB2D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D55" edc:desc="" edc:mask="0x1" edc:name="TXB2D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D56" edc:desc="" edc:mask="0x1" edc:name="TXB2D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D57" edc:desc="" edc:mask="0x1" edc:name="TXB2D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX2B4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX2B4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D6" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D7" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TX2B2D60" edc:desc="" edc:mask="0x1" edc:name="TX2B2D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D61" edc:desc="" edc:mask="0x1" edc:name="TX2B2D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D62" edc:desc="" edc:mask="0x1" edc:name="TX2B2D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D63" edc:desc="" edc:mask="0x1" edc:name="TX2B2D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D64" edc:desc="" edc:mask="0x1" edc:name="TX2B2D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D65" edc:desc="" edc:mask="0x1" edc:name="TX2B2D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D66" edc:desc="" edc:mask="0x1" edc:name="TX2B2D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D67" edc:desc="" edc:mask="0x1" edc:name="TX2B2D67" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D70" edc:desc="" edc:mask="0x1" edc:name="TX2B2D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D71" edc:desc="" edc:mask="0x1" edc:name="TX2B2D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D72" edc:desc="" edc:mask="0x1" edc:name="TX2B2D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D73" edc:desc="" edc:mask="0x1" edc:name="TX2B2D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D74" edc:desc="" edc:mask="0x1" edc:name="TX2B2D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D75" edc:desc="" edc:mask="0x1" edc:name="TX2B2D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D76" edc:desc="" edc:mask="0x1" edc:name="TX2B2D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2B2D77" edc:desc="" edc:mask="0x1" edc:name="TX2B2D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnnn-nn" edc:cname="C1TX2CON" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000-00" edc:name="C1TX2CON" edc:nzwidth="0x10" edc:por="---------0000-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXPRI" edc:desc="" edc:mask="0x3" edc:name="TXPRI" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn---nnnnnnnn" edc:cname="C1TX1SID" edc:desc="" edc:impl="0xf8ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu---uuuuuuuu" edc:name="C1TX1SID" edc:nzwidth="0x10" edc:por="xxxxxuuuxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXIDE" edc:desc="" edc:mask="0x1" edc:name="TXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SID5_0" edc:desc="" edc:mask="0x1" edc:name="SID5_0" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID10_6" edc:desc="" edc:mask="0x1" edc:name="SID10_6" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----nnnnnnnn" edc:cname="C1TX1EID" edc:desc="" edc:impl="0xf0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu----uuuuuuuu" edc:name="C1TX1EID" edc:nzwidth="0x10" edc:por="xxxx----xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID13_6" edc:desc="" edc:mask="0x1" edc:name="EID13_6" edc:nzwidth="0x8"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="EID17_14" edc:desc="" edc:mask="0x1" edc:name="EID17_14" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="C1TX1DLC" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuu---" edc:name="C1TX1DLC" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxx---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="" edc:mask="0xf" edc:name="DLC" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TXRB0" edc:desc="" edc:mask="0x1" edc:name="TXRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRB1" edc:desc="" edc:mask="0x1" edc:name="TXRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0xA"/>
              <edc:SFRFieldDef edc:cname="EID5_0" edc:desc="" edc:mask="0x1" edc:name="EID5_0" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
