balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6011.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RX1B4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1RX1B4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB1D6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D6" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB1D7" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB1D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB1D60" edc:desc="" edc:mask="0x1" edc:name="TXB1D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D61" edc:desc="" edc:mask="0x1" edc:name="TXB1D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D62" edc:desc="" edc:mask="0x1" edc:name="TXB1D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D63" edc:desc="" edc:mask="0x1" edc:name="TXB1D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D64" edc:desc="" edc:mask="0x1" edc:name="TXB1D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D65" edc:desc="" edc:mask="0x1" edc:name="TXB1D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D66" edc:desc="" edc:mask="0x1" edc:name="TXB1D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D67" edc:desc="" edc:mask="0x1" edc:name="TXB1D67" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D70" edc:desc="" edc:mask="0x1" edc:name="TXB1D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D71" edc:desc="" edc:mask="0x1" edc:name="TXB1D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D72" edc:desc="" edc:mask="0x1" edc:name="TXB1D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D73" edc:desc="" edc:mask="0x1" edc:name="TXB1D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D74" edc:desc="" edc:mask="0x1" edc:name="TXB1D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D75" edc:desc="" edc:mask="0x1" edc:name="TXB1D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D76" edc:desc="" edc:mask="0x1" edc:name="TXB1D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB1D77" edc:desc="" edc:mask="0x1" edc:name="TXB1D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------c---rrrr" edc:cname="C1RX1CON" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0---0000" edc:name="C1RX1CON" edc:nzwidth="0x10" edc:por="--------0---0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT" edc:desc="" edc:mask="0x7" edc:name="FILHIT" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnnnnnnnnnn" edc:cname="C1RX0SID" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuuuuuuuuuu" edc:name="C1RX0SID" edc:nzwidth="0x10" edc:por="uuuxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXIDE" edc:desc="" edc:mask="0x1" edc:name="RXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x1" edc:name="SID" edc:nzwidth="0xB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
